html/programming-language/go/basis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-07 Thu 18:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go基础</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="LiGuo" />
</head>
<body>
<div id="content">
<h1 class="title">Go基础</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org21606b7"><span class="todo TODO">TODO</span> 简介</a></li>
<li><a href="#orge1d1dd0">程序结构</a>
<ul>
<li><a href="#org51af209"><span class="todo TODO">TODO</span> 名称</a></li>
<li><a href="#org9bde6b6">声明</a></li>
<li><a href="#org9c6f481">变量</a>
<ul>
<li><a href="#org76bc77f">短变量声明</a></li>
<li><a href="#org30c8c53">指针</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgee89d0d">基本数据类型</a>
<ul>
<li><a href="#orgceb9e77">整数</a></li>
<li><a href="#org2a589a1">浮点数</a></li>
<li><a href="#orgae1c151">复数</a></li>
<li><a href="#org5a89dec">布尔值</a></li>
<li><a href="#orgad24682">字符串</a></li>
<li><a href="#orga2b7c34">常量</a></li>
</ul>
</li>
<li><a href="#org377bc96">复合数据类型</a>
<ul>
<li><a href="#orgbe664ec">数组</a></li>
<li><a href="#org1e3c240">slice</a></li>
<li><a href="#org646d4ee">map</a></li>
<li><a href="#orge7a1930">结构体</a></li>
</ul>
</li>
<li><a href="#orgf4a71aa">函数</a></li>
<li><a href="#org2950f2e">方法</a></li>
<li><a href="#org8a70262">接口</a></li>
<li><a href="#org938d5f2">goroutine和通道</a></li>
</ul>
</div>
</div>

<div id="outline-container-org21606b7" class="outline-2">
<h2 id="org21606b7"><span class="todo TODO">TODO</span> 简介</h2>
<div class="outline-text-2" id="text-org21606b7">
<p>
Go是Google开发的一种静态强类型、编译行、并发行，并具有垃圾回收功能的编程语言。
</p>
</div>
</div>

<div id="outline-container-orge1d1dd0" class="outline-2">
<h2 id="orge1d1dd0">程序结构</h2>
<div class="outline-text-2" id="text-orge1d1dd0">
</div>
<div id="outline-container-org51af209" class="outline-3">
<h3 id="org51af209"><span class="todo TODO">TODO</span> 名称</h3>
<div class="outline-text-3" id="text-org51af209">
<p>
Go中函数、变量、常量、类型、语句标签和包的名称遵循一个简单的规则：名称的开头是一个字母（Unicode中的字符即可）或下划线，后面可以跟任意数量的字符、数字和下划线，并区分大小写。
</p>

<p>
Go的关键字，只能用在语法允许的地方，它们不能作为名称：
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">break</td>
<td class="org-left">default</td>
<td class="org-left">func</td>
<td class="org-left">interface</td>
<td class="org-left">select</td>
</tr>

<tr>
<td class="org-left">case</td>
<td class="org-left">defer</td>
<td class="org-left">go</td>
<td class="org-left">map</td>
<td class="org-left">struct</td>
</tr>

<tr>
<td class="org-left">chan</td>
<td class="org-left">else</td>
<td class="org-left">goto</td>
<td class="org-left">package</td>
<td class="org-left">switch</td>
</tr>

<tr>
<td class="org-left">const</td>
<td class="org-left">fallthrough</td>
<td class="org-left">if</td>
<td class="org-left">range</td>
<td class="org-left">type</td>
</tr>

<tr>
<td class="org-left">continue</td>
<td class="org-left">for</td>
<td class="org-left">import</td>
<td class="org-left">return</td>
<td class="org-left">var</td>
</tr>
</tbody>
</table>

<p>
另外，还有一些内置的的预声明的常量、类型和函数：
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">常量：</td>
<td class="org-left">true</td>
<td class="org-left">false</td>
<td class="org-left">iota</td>
<td class="org-left">nil</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">类型：</td>
<td class="org-left">int</td>
<td class="org-left">int8</td>
<td class="org-left">int16</td>
<td class="org-left">int32</td>
<td class="org-left">int64</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">uint</td>
<td class="org-left">uint8</td>
<td class="org-left">uint16</td>
<td class="org-left">uint32</td>
<td class="org-left">uint64</td>
<td class="org-left">uintptr</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">float32</td>
<td class="org-left">float64</td>
<td class="org-left">complex64</td>
<td class="org-left">complex128</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">bool</td>
<td class="org-left">byte</td>
<td class="org-left">rune</td>
<td class="org-left">string</td>
<td class="org-left">error</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">函数：</td>
<td class="org-left">make</td>
<td class="org-left">len</td>
<td class="org-left">cap</td>
<td class="org-left">new</td>
<td class="org-left">append</td>
<td class="org-left">copy</td>
<td class="org-left">close</td>
<td class="org-left">delete</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">complex</td>
<td class="org-left">real</td>
<td class="org-left">imag</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">panic</td>
<td class="org-left">recover</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
这些名称不是预留的，可以在声明中使用它们。我们将在很多地方看到对其中的名称进行重声明，但是要知道这有冲突的风险。
</p>

<p>
名称本身没有长度限制，但是习惯以及Go的编程风格倾向于使用短名称，特别是作用域较小的局部变量。通常，名称的作用域越大，就使用越长且更有意义的名称。
</p>

<p>
风格上，当遇到由单词组合的名称时，Go程序员使用“驼峰法”的风格 &#x2013; 更喜欢使用大写字母而不是下划线。像ASCII和HTML这样的首字母缩写词通常使用相同的大小写。
</p>
</div>
</div>

<div id="outline-container-org9bde6b6" class="outline-3">
<h3 id="org9bde6b6">声明</h3>
<div class="outline-text-3" id="text-org9bde6b6">
<p>
声明给一个程序实体命名，并且设定其部分或全部属性。有4个主要的声明：变量（var）、常量（const）、类型（type）和函数（func）。
</p>

<p>
Go程序存储在一个或多个以.go为后缀的文件里。每一个文件以package声明开头，表明文件属于哪个包。package声明后面是import声明，然后是包级别的类型、变量、常量、函数的声明，不区分顺序。
</p>
</div>
</div>

<div id="outline-container-org9c6f481" class="outline-3">
<h3 id="org9c6f481">变量</h3>
<div class="outline-text-3" id="text-org9c6f481">
<p>
var声明创建一个具体类型的变量，然后给它附加一个名字，设置它的初始值。每一个声明有一个通用的形式：var name type = expression
</p>

<p>
类型和表达式部分可以省略一个，但是不能都省略。如果类型省略，它的类型将由初始化表达式决定；如果表达式省略，其初始值对应于类型的零值 &#x2013; 对于数字是0，对于布尔值是false，对于字符串是""，对于接口和引用类型（slice、指针、map、通道、函数）是nil。对于一个像数组或结构体这样的复合类型，零值是其所有元素或成员的零值。
</p>

<p>
零值机制保障所有的变量是良好定义的，Go里面不存在未初始化变量。这种机制简化了代码，并且不需要额外工作就能感知边界条件的行为。Go程序员经常花费精力来使复杂类型的零值有意义，以便变量一开始就处于一个可用状态。
</p>

<p>
可以声明一个变量列表，并选择使用对应的表达式列表对其初始化。忽略类型允许声明多个不同类型的变量。
</p>

<p>
初始值设定可以是字面量值或者任意的表达式。包级别的初始化在main开始之前进行，局部变量初始化和声明一样在函数执行期间进行。
</p>

<p>
变量可以通过调用返回多个值的函数进行初始化。
</p>
</div>

<div id="outline-container-org76bc77f" class="outline-4">
<h4 id="org76bc77f">短变量声明</h4>
<div class="outline-text-4" id="text-org76bc77f">
<p>
在函数中，一种称作短变量声明的可选形式可以用来声明和初始化局部变量。它使用name := expression的形式，name的类型由expression的类型决定。
</p>

<p>
因其短小、灵活，故而在局部变量的声明和初始化中主要使用短声明。var声明通常是为那些跟初始化表达式不一致的局部变量保留的，或者用于后面才对变量赋值以及变量初始值不重要的情况。
</p>

<p>
:=表示声明，而=表示赋值。
</p>

<p>
一个容易被忽略但重要的地方是：短变量声明不需要声明所有在左边的变量。如果一些变量在同一个词法块中声明，那么对于那些变量，短声明的行为等同于赋值。
</p>

<p>
只有在同一个词法块中已经存在的变量的情况下，短声明的行为才和赋值操作一样，外层的声明将被忽略。
</p>
</div>
</div>

<div id="outline-container-org30c8c53" class="outline-4">
<h4 id="org30c8c53">指针</h4>
</div>
</div>
</div>



<div id="outline-container-orgee89d0d" class="outline-2">
<h2 id="orgee89d0d">基本数据类型</h2>
<div class="outline-text-2" id="text-orgee89d0d">
</div>
<div id="outline-container-orgceb9e77" class="outline-3">
<h3 id="orgceb9e77">整数</h3>
<div class="outline-text-3" id="text-orgceb9e77">
<p>
Go同时具备有符号整数和无符号整数。有符号整数分四种大小：8位、16位、32位、64位，用int8、int16、int32、int64表示，对应的无符号整数是uint8、uint16、uint32、uint64。
</p>

<p>
此外还有两种类型int和uint。int是目前使用最广泛的数值类型。这两种类型大小相等，都是32位或64位，但不能认为它们一定就是32位，或一定就是64位；即使在相同的硬件平台上，不同的编译器可能选用不同的大小。
</p>

<p>
rune类型是int32类型的同义词，常常用于指明一个值的Unicode码点（code point）。同样，byte类型是uint8类型的同义词，强调一个值是原始数据，而非量值。
</p>

<p>
最后，还有一种无符号整数uintptr，其大小并不明确，但足以完整存放指针。uintptr类型仅仅用于底层编程。
</p>

<p>
int、uint和uintptr都有别于其大小明确的相似类型的类型。
</p>

<p>
有符号整数以补码表示，保留最高位作为符号位，n位数字的取值范围是-2<sup>(n-1)</sup>~2<sup>(n-1)</sup>-1。无符号整数由全部位构成其非负值，范围是0~x<sup>n</sup>-1。
</p>
</div>
</div>


<div id="outline-container-org2a589a1" class="outline-3">
<h3 id="org2a589a1">浮点数</h3>
<div class="outline-text-3" id="text-org2a589a1">
<p>
Go具有两种大小的浮点数float32和float64。其算术特性遵从IEEE 754标准，所有新式CPU都支持该标准。
</p>

<p>
这两个类型的值可从极细微到超宏大。
</p>

<p>
十进制下，float32的有效数字大约是6位，float64的有效数字大约是15位。绝大多数情况下，应优先选用float64，因为除非格外小心，否则float32的运算会迅速累积误差。
</p>

<p>
在源码中，浮点数可写成小数，小数点前的数字可以省略（.707），后面的也可省去（1.）。非常小或非常大的数字最好使用科学计数法表示，此方法在数量级指数前写字母e或E。
</p>
</div>
</div>



<div id="outline-container-orgae1c151" class="outline-3">
<h3 id="orgae1c151">复数</h3>
</div>

<div id="outline-container-org5a89dec" class="outline-3">
<h3 id="org5a89dec">布尔值</h3>
</div>

<div id="outline-container-orgad24682" class="outline-3">
<h3 id="orgad24682">字符串</h3>
</div>

<div id="outline-container-orga2b7c34" class="outline-3">
<h3 id="orga2b7c34">常量</h3>
</div>
</div>

<div id="outline-container-org377bc96" class="outline-2">
<h2 id="org377bc96">复合数据类型</h2>
<div class="outline-text-2" id="text-org377bc96">
</div>
<div id="outline-container-orgbe664ec" class="outline-3">
<h3 id="orgbe664ec">数组</h3>
</div>

<div id="outline-container-org1e3c240" class="outline-3">
<h3 id="org1e3c240">slice</h3>
</div>

<div id="outline-container-org646d4ee" class="outline-3">
<h3 id="org646d4ee">map</h3>
</div>

<div id="outline-container-orge7a1930" class="outline-3">
<h3 id="orge7a1930">结构体</h3>
</div>
</div>

<div id="outline-container-orgf4a71aa" class="outline-2">
<h2 id="orgf4a71aa">函数</h2>
</div>

<div id="outline-container-org2950f2e" class="outline-2">
<h2 id="org2950f2e">方法</h2>
</div>

<div id="outline-container-org8a70262" class="outline-2">
<h2 id="org8a70262">接口</h2>
</div>

<div id="outline-container-org938d5f2" class="outline-2">
<h2 id="org938d5f2">goroutine和通道</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: LiGuo</p>
<p class="date">Created: 2021-01-07 Thu 18:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
